{
  "lessons": [
    {
      "id": "codigo",
      "title": "💻 Código — instrucciones para la máquina",
      "content": "El código es el conjunto de instrucciones que escribimos para que la computadora realice tareas específicas. Puede ser interpretado (se ejecuta línea a línea) o compilado (se transforma a un binario eficiente). En esta plataforma todo es simulado: el código que ves no ejecuta acciones peligrosas ni toca tu sistema.\n\nLa estructura del código sigue principios: modularidad (separar en funciones/módulos), legibilidad (nombres claros), manejo de errores (prever fallas y responder), y seguridad (validar entradas, evitar inyecciones). Estos pilares hacen que el software sea mantenible y confiable.\n\nPensalo como una receta profesional: ingredientes (datos), pasos (algoritmos), herramientas (APIs/librerías). Si medís, probás y documentás, el plato sale igual cada vez. En este curso ponemos foco en simular procesos de red y ciberseguridad con seguridad: nada que escribas aquí interactúa con tu sistema real.",
      "interactive": "none",
      "quiz": {
        "q": "¿Qué analogía describe mejor el código?",
        "options": ["Un dibujo al azar", "Una receta con pasos claros"],
        "a": 1
      }
    },
    {
      "id": "osi",
      "title": "🧩 Modelo OSI — capas y responsabilidades",
      "content": "El modelo OSI es un marco conceptual que divide la comunicación en 7 capas con responsabilidades bien definidas: Aplicación, Presentación, Sesión, Transporte, Red, Enlace y Física. Cada capa brinda servicios a la superior y utiliza los de la inferior, permitiendo aislar problemas y diseñar protocolos con claridad.\n\nAl pensar en OSI, ubicás conceptos en su nivel: direcciones IP en Red, puertos y control de flujo en Transporte, formato/cifrado en Presentación, y así. Esta separación ayuda a diagnosticar: si el enlace falla, revisás cableado o MAC; si la red falla, mirás rutas; si transporte falla, mirás retransmisión y puertos.\n\nAnalogía: un envío postal profesional. La capa de Aplicación decide qué mandar y a quién; Presentación asegura formato/idioma correcto; Sesión coordina el diálogo; Transporte garantiza entrega y orden; Red elige rutas; Enlace pone remitente/destinatario físicos; Física convierte todo en señales por el medio.",
      "interactive": "osi-drag",
      "quiz": {
        "q": "¿Qué capa se encarga del direccionamiento lógico (IPs)?",
        "options": ["Capa de Transporte", "Capa de Red", "Capa de Enlace", "Capa de Aplicación"],
        "a": 1
      }
    },
    {
      "id": "tcp-udp",
      "title": "📦 TCP vs UDP 🚀",
      "content": "TCP y UDP viven en la capa de Transporte. TCP ofrece conexión confiable: handshake (SYN/ACK), ordenamiento, retransmisión, control de congestión y flujo. Es ideal cuando no podés perder datos ni desordenarlos (HTTP, SSH, SMTP).\n\nUDP es sin conexión: envía datagramas sin confirmar ni reintentar automáticamente. Es perfecto cuando importa la latencia y el app tolera pérdidas (DNS, streaming, VoIP). Con UDP, la aplicación debe manejar reintentos/compensación si los necesita.\n\nAnalogía: TCP es un envío certificado con acuse y seguimiento; UDP es una postal exprés. Si la postal se pierde, la aplicación decide si reintenta; el protocolo no lo hace por vos.",
      "interactive": "sim-compare",
      "quiz": {
        "q": "¿Cuál ofrece control de congestión y retransmisión?",
        "options": ["UDP", "TCP"],
        "a": 1
      }
    },
    {
      "id": "ip",
      "title": "🌐 IP (IPv4/IPv6)",
      "content": "IP opera en la capa de Red y resuelve el enrutamiento entre redes. IPv4 usa direcciones de 32 bits (agotadas en muchos lugares), mientras que IPv6 expande a 128 bits y mejora autoconfiguración, multidifusión y simplifica la NATización. La capa IP también fragmenta cuando un enlace no soporta el tamaño del paquete.\n\nEl enrutamiento se apoya en tablas estáticas o protocolos dinámicos (OSPF, BGP). Dual‑stack permite correr IPv4/IPv6 en paralelo; túneles conectan islas IPv6 sobre infraestructura IPv4 y viceversa.\n\nAnalogía: IP es el GPS del paquete: sabe a qué ciudad y barrio llevarlo. El número de departamento lo decide la capa de enlace (MAC) en la entrega local.",
      "interactive": "none",
      "quiz": {
        "q": "¿Cuál es el tamaño de dirección IPv4?",
        "options": ["64 bits", "32 bits", "128 bits", "16 bits"],
        "a": 1
      }
    },
    {
      "id": "icmp",
      "title": "📡 ICMP — Mensajes de control (ping)",
      "content": "ICMP acompaña a IP brindando mensajes de control y error: Destination Unreachable, Time Exceeded, Redirect, entre otros. No transporta datos de usuario; sirve para diagnóstico y señalización dentro de la red.\n\nHerramientas como ping usan Echo Request/Reply para comprobar conectividad y medir RTT. Traceroute incrementa el TTL para provocar Time Exceeded en cada hop y así mapear el camino hacia el destino.\n\nAnalogía: señales y carteles en la ruta IP: avisan cortes, desvíos, demoras y si el destinatario responde a tu llamado.",
      "interactive": "icmp",
      "quiz": {
        "q": "¿Qué mensaje ICMP usa ping para probar conectividad?",
        "options": ["Time Exceeded", "Echo Request/Reply", "Destination Unreachable", "Redirect"],
        "a": 1
      }
    },
    {
      "id": "arp",
      "title": "🪪 ARP — Resolución IP ↔ MAC",
      "content": "ARP traduce direcciones IP locales a direcciones MAC para que las tramas Ethernet lleguen al destinatario correcto. Cuando un host quiere enviar a una IP del mismo segmento, lanza un broadcast ARP Request. El dueño responde con su MAC y ambos actualizan cachés ARP.\n\nLa caché evita tener que preguntar cada vez. En IPv6 la función equivalente se llama Neighbor Discovery (ND), con mensajes ICMPv6.\n\nAnalogía: tenés el interno (IP), pero necesitás la persona (MAC). Hacés una pregunta a toda la oficina y quien corresponde te contesta.",
      "interactive": "arp",
      "quiz": {
        "q": "¿Cómo pregunta ARP por una MAC?",
        "options": ["Unicast al host", "Broadcast al segmento", "Multicast de capa 3", "HTTP"],
        "a": 1
      }
    },
    {
      "id": "rarp",
      "title": "🔁 RARP — Resolución inversa",
      "content": "RARP permitía a un dispositivo obtener su IP partiendo de su MAC, útil para equipos que arrancaban sin configuración. Con el tiempo fue reemplazado por BOOTP y luego por DHCP, que son más flexibles y entregan parámetros adicionales (gateway, DNS, lease).\n\nSu obsolescencia se debe a que DHCP resuelve el mismo problema y más, incluyendo renovación de concesiones y opciones avanzadas.\n\nAnalogía: presentar tu credencial (MAC) en recepción y recibir tu dirección IP y además el mapa de la oficina (gateway/DNS).",
      "interactive": "none",
      "quiz": {
        "q": "¿Qué protocolo reemplazó a RARP?",
        "options": ["DNS", "BOOTP/DHCP", "SSH", "ICMP"],
        "a": 1
      }
    },
    {
      "id": "dhcp",
      "title": "🔌 DHCP — Asignación dinámica de IP (67/68)",
      "content": "DHCP automatiza la configuración de red: asigna IP, máscara, gateway, DNS y más mediante el ciclo DORA (Discover, Offer, Request, Ack). Los servidores gestionan pools y tiempos de concesión para reutilizar direcciones y mantener orden.\n\nSoporta reservas por MAC, opciones específicas (como NTP, dominio), y renovación cuando el lease expira. Es fundamental en redes corporativas y domésticas para simplificar administración.\n\nAnalogía: recibir un ticket con asiento asignado y reglas de uso por tiempo determinado; si termina, pedís renovación.",
      "interactive": "dhcp",
      "quiz": {
        "q": "¿Cuál es el orden correcto de DORA?",
        "options": ["Offer, Discover, Ack, Request", "Discover, Offer, Request, Ack", "Request, Discover, Offer, Ack", "Ack, Request, Offer, Discover"],
        "a": 1
      }
    },
    {
      "id": "dns",
      "title": "🧭 DNS — Nombres a IP (53/UDP/TCP)",
      "content": "DNS resuelve nombres a direcciones y otros registros (A/AAAA, MX, NS, TXT). La resolución recursiva comienza en el resolvedor local, que consulta a root servers, luego TLD, y termina en el autoritativo del dominio. Se cachean respuestas para mejorar rendimiento.\n\nFunciona principalmente sobre UDP 53; TCP 53 se usa para transferencias de zona (AXFR) y respuestas extensas, especialmente con DNSSEC. La seguridad depende de validar firmas y de políticas anti‑spoofing.\n\nAnalogía: una guía distribuida y jerárquica: vas escalando consultas hasta llegar al custodio oficial del registro.",
      "interactive": "dns",
      "quiz": {
        "q": "¿Qué servidor conoce los registros definitivos de un dominio?",
        "options": ["Root", "TLD", "Autoritativo", "Cache CDN"],
        "a": 2
      }
    },
    {
      "id": "http-https",
      "title": "🌐🔒 HTTP/HTTPS — Web (80/443)",
      "content": "HTTP es el protocolo de la web: define métodos (GET, POST, PUT…), cabeceras, cuerpos y códigos de estado (200, 404…). Trabaja típicamente sobre TCP y permite extensiones (cookies, compresión, caching).\n\nHTTPS añade TLS: se negocian suites de cifrado y se validan certificados para asegurar identidad y confidencialidad. Mejores prácticas incluyen HSTS, TLS 1.2/1.3 y deshabilitar suites débiles.\n\nAnalogía: enviar una carta con sobre (HTTP) o con sobre sellado oficial (HTTPS) que además certifica el remitente.",
      "interactive": "tls",
      "quiz": {
        "q": "¿Qué añade HTTPS respecto a HTTP?",
        "options": ["Puertos diferentes sin cifrado", "Cifrado y autenticación (TLS)", "Solo cambio de método GET", "UDP en vez de TCP"],
        "a": 1
      }
    },
    {
      "id": "ftp",
      "title": "📁 FTP — Transferencia de archivos (21)",
      "content": "FTP separa control y datos: comandos viajan por el puerto 21/tcp y los archivos por puertos dinámicos (modo activo/pasivo). Este diseño complica firewalls pero permite eficiencia.\n\nNo cifra por defecto, por lo que credenciales y contenido quedan expuestos. Para seguridad, usar FTPS (TLS sobre FTP) o preferir SFTP (sobre SSH) que es diferente pero seguro.\n\nAnalogía: una línea para negociar y otra para transferir, pero sin candado; el candado se agrega con FTPS/SFTP.",
      "interactive": "none",
      "quiz": {
        "q": "¿Por qué FTP es inseguro por defecto?",
        "options": ["Usa UDP", "No cifra credenciales ni datos", "No tiene autenticación", "Solo funciona en LAN"],
        "a": 1
      }
    },
    {
      "id": "sftp",
      "title": "🔐📁 SFTP — Seguro sobre SSH (22)",
      "content": "SFTP aprovecha el canal seguro de SSH (22/tcp) para mover archivos con autenticación robusta (claves públicas) y cifrado. Soporta operaciones habituales (listar, subir, bajar) con control de permisos y auditoría.\n\nNo es FTP con TLS: es otro protocolo, con semántica propia, y suele ser más simple de configurar seguro que FTPS.\n\nAnalogía: una bóveda con llave única donde cada movimiento queda registrado y el pasillo está cifrado.",
      "interactive": "none",
      "quiz": {
        "q": "SFTP se basa en…",
        "options": ["TLS", "SSH", "ICMP", "HTTP"],
        "a": 1
      }
    },
    {
      "id": "smtp",
      "title": "✉️ SMTP — Envío de correos (25/587/465)",
      "content": "SMTP mueve correo entre servidores (25/tcp). Para clientes, el envío autenticado usa 587/tcp con AUTH y puede activar STARTTLS si el servidor lo soporta; 465/tcp se reserva para SMTPS (TLS directo).\n\nPara reputación y seguridad, se combinan SPF/DKIM/DMARC, evitando suplantación y mejorando entrega.\n\nAnalogía: el circuito postal: oficinas centrales se comunican por líneas directas, y el mostrador de clientes exige identificación y sobre sellado.",
      "interactive": "none",
      "quiz": {
        "q": "¿Qué comando inicia cifrado oportunista en SMTP?",
        "options": ["STARTTLS", "HELO", "DATA", "AUTH"],
        "a": 0
      }
    },
    {
      "id": "pop3-imap",
      "title": "📥 POP3/IMAP — Recepción (110/143/993/995)",
      "content": "POP3 descarga correos al cliente y, según configuración, los elimina del servidor. Es simple pero no sincroniza estados entre dispositivos. IMAP mantiene correos y carpetas en el servidor y sincroniza banderas (leído, archivado), ideal para múltiples clientes.\n\nAmbos pueden usar TLS en puertos dedicados o STARTTLS. Elegí IMAP si necesitás consistencia entre móvil y PC; POP3 si querés un flujo local sin sincronización.\n\nAnalogía: POP3 es retirar correspondencia y guardarla en casa; IMAP es revisar un buzón central compartido siempre actualizado.",
      "interactive": "none",
      "quiz": {
        "q": "¿Cuál permite sincronizar carpetas y estados?",
        "options": ["POP3", "IMAP"],
        "a": 1
      }
    },
    {
      "id": "snmp",
      "title": "🛠️ SNMP — Gestión de red (161/udp)",
      "content": "SNMP permite monitorizar y administrar dispositivos de red mediante OIDs (identificadores de objeto) y tablas MIB. v1/v2c usan community strings para acceso (read/write), pero sin cifrado.\n\nSNMPv3 introduce autenticación, integridad y cifrado, adecuado para redes inseguras. Es habitual integrar SNMP con sistemas de monitoreo y alertas.\n\nAnalogía: un tablero que consulta valores por códigos y recibe respuestas estructuradas para graficar y decidir.",
      "interactive": "none",
      "quiz": {
        "q": "¿Qué versión añade autenticación y cifrado?",
        "options": ["v1", "v2c", "v3"],
        "a": 2
      }
    },
    {
      "id": "telnet",
      "title": "⚠️ Telnet — Remoto inseguro (23/tcp)",
      "content": "Telnet ofrece acceso remoto en texto plano. Las credenciales y comandos viajan sin cifrar, exponiendo la sesión a intercepción. Fue útil históricamente, pero hoy debe evitarse fuera de entornos totalmente controlados.\n\nEl reemplazo moderno es SSH, que cifra y autentica con claves. Si encontrás Telnet en producción, es una alerta de riesgo.\n\nAnalogía: hablar por un megáfono en un lugar concurrido: cualquiera que pase escucha todo.",
      "interactive": "none",
      "quiz": {
        "q": "¿Por qué se evita Telnet en producción?",
        "options": ["Usa puerto 23", "No cifra credenciales", "Solo funciona en Linux", "No tiene comandos"],
        "a": 1
      }
    },
    {
      "id": "ssh",
      "title": "🔐 SSH — Remoto seguro (22/tcp)",
      "content": "SSH establece canales cifrados para administración remota. Autentica por claves públicas, soporta reenvío de puertos, túneles y transferencia de archivos (SFTP/scp). Configuraciones seguras deshabilitan login de root y fuerzan claves.\n\nCon SSH podés crear túneles seguros para aplicaciones, encapsular tráfico y auditar sesiones. Es estándar en administración moderna.\n\nAnalogía: una línea privada con candado fuerte y control de quién entra (llave pública/privada).",
      "interactive": "none",
      "quiz": {
        "q": "SSH autentica típicamente con…",
        "options": ["Certificados X.509", "Claves públicas", "Contraseñas en texto plano", "Tokens ICMP"],
        "a": 1
      }
    },
    {
      "id": "ldap",
      "title": "🗂️ LDAP — Directorios y autenticación (389/636)",
      "content": "LDAP organiza datos jerárquicos (personas, grupos, dispositivos) y permite consultas expresivas con filtros. Es base de autenticación/autorización en muchos entornos y se integra con SSO (Kerberos, OAuth).\n\nLDAPS cifra el canal para proteger credenciales y atributos sensibles. Buen diseño de esquemas y ACLs es clave para seguridad y rendimiento.\n\nAnalogía: una agenda corporativa estructurada con permisos finos para quién puede ver o modificar cada ficha.",
      "interactive": "none",
      "quiz": {
        "q": "LDAPS añade…",
        "options": ["UDP", "TLS", "ICMP", "FTP"],
        "a": 1
      }
    },
    {
      "id": "ntp",
      "title": "⏱️ NTP — Sincronización de tiempo (123/udp)",
      "content": "NTP sincroniza relojes con precisión usando una jerarquía de servidores (stratum). Corre sobre UDP 123 y requiere filtrado y rate‑limit para no ser abusado en ataques de amplificación.\n\nLa hora correcta afecta logs, expiración de certificados y análisis forense. Fuentes confiables y reglas de acceso son críticas.\n\nAnalogía: ajustar todos los relojes según un reloj maestro validado y protegido.",
      "interactive": "none",
      "quiz": {
        "q": "NTP usa generalmente…",
        "options": ["TCP", "UDP"],
        "a": 1
      }
    },
    {
      "id": "tftp",
      "title": "📤 TFTP — Transferencia trivial (69/udp)",
      "content": "TFTP realiza transferencia simple sin autenticación ni cifrado, ideal para entornos cerrados (PXE boot, firmware). Su simplicidad es fortaleza y debilidad: fácil de usar, inseguro fuera de LAN controladas.\n\nConfiguralo con listas de acceso y rutas limitadas; nunca lo expongas públicamente.\n\nAnalogía: una mesa común para dejar/recoger cajas dentro de una sala segura; afuera sería riesgoso.",
      "interactive": "none",
      "quiz": {
        "q": "¿Por qué TFTP no es seguro?",
        "options": ["No cifra y no autentica", "Usa ICMP", "Depende de TLS", "Solo funciona en IPv6"],
        "a": 0
      }
    },
    {
      "id": "sip",
      "title": "📞 SIP — Señalización VoIP (5060/5061)",
      "content": "SIP crea, modifica y termina sesiones multimedia, negociando codecs y parámetros. La señalización puede ir cifrada (TLS/SIPS) y los medios se trasladan por RTP, con RTCP para estadísticas. Puertos de medios suelen ser dinámicos y requieren NAT traversal.\n\nPara proteger audio/video, se emplea SRTP con claves negociadas. Infraestructuras VoIP suelen incluir proxies y registrars.\n\nAnalogía: recepción que conecta llamadas y decide cómo hablar; la voz viaja por líneas específicas separadas del pedido.",
      "interactive": "none",
      "quiz": {
        "q": "¿Qué protocolo lleva el audio en llamadas SIP?",
        "options": ["RTP", "ICMP", "FTP", "DNS"],
        "a": 0
      }
    },
    {
      "id": "rdp",
      "title": "🖥️ RDP — Escritorio remoto (3389)",
      "content": "RDP permite acceder al escritorio de Windows a distancia. Por historial de vulnerabilidades, es clave habilitar NLA, aplicar parches y restringir exposición (idealmente detrás de VPN o un bastión).\n\nPolíticas de cuenta, MFA y registros de acceso mejoran seguridad y trazabilidad.\n\nAnalogía: manejar la PC con un control remoto desde otra habitación, con candados y vigilancia.",
      "interactive": "none",
      "quiz": {
        "q": "RDP corre típicamente en el puerto…",
        "options": ["22", "23", "3389", "80"],
        "a": 2
      }
    },
    {
      "id": "smb",
      "title": "🗄️ SMB — Compartición en Windows (445/tcp)",
      "content": "SMB facilita shares de archivos e impresoras. Versiones antiguas (SMBv1) tienen fallas conocidas; usar SMBv2/v3 con firmas y cifrado cuando sea posible. Controlar permisos y auditoría evita fugas.\n\nIntegrado con Active Directory, permite políticas finas y mapeo de unidades.\n\nAnalogía: una sala de archivo con cerraduras modernas y registro de entradas/salidas.",
      "interactive": "none",
      "quiz": {
        "q": "SMB se usa para…",
        "options": ["Correo", "Compartir archivos e impresoras", "DNS", "Tiempo"],
        "a": 1
      }
    },
    {
      "id": "netbios",
      "title": "🧱 NetBIOS — Windows antiguo (137/138/139)",
      "content": "NetBIOS daba servicios de nombres, datagramas y sesión en redes Windows antiguas (137/udp, 138/udp, 139/tcp). Su diseño quedó superado por DNS para nombres y SMB moderno para compartición.\n\nDeshabilitarlo reduce superficie de ataque en entornos actuales.\n\nAnalogía: una agenda de papel local reemplazada por directorios y servicios centralizados más seguros.",
      "interactive": "none",
      "quiz": {
        "q": "NetBIOS fue reemplazado principalmente por…",
        "options": ["ICMP", "DNS/SMB", "HTTP", "SSH"],
        "a": 1
      }
    },
    {
      "id": "gre",
      "title": "📦 GRE — Encapsulación genérica (proto 47)",
      "content": "GRE crea túneles que encapsulan diferentes protocolos sobre IP (proto 47). Es flexible y simple, útil para conectar redes dispares o transportar tráfico no IP.\n\nCarece de seguridad intrínseca; se combina con IPsec para cifrar y autenticar el túnel. Se usa en topologías overlay.\n\nAnalogía: poner varias cajas pequeñas dentro de una caja grande para que viajen juntas por la misma ruta.",
      "interactive": "none",
      "quiz": {
        "q": "GRE por sí solo…",
        "options": ["Cifra el tráfico", "Solo encapsula sin cifrar", "Autentica usuarios", "Resuelve nombres"],
        "a": 1
      }
    },
    {
      "id": "ipsec",
      "title": "🛡️ IPsec — Seguridad de red (VPN)",
      "content": "IPsec provee autenticación, integridad y confidencialidad al tráfico IP. AH asegura origen e integridad; ESP añade cifrado. En modo transporte protege el payload; en modo túnel encapsula todo el paquete para enlaces entre gateways.\n\nEs base de muchas VPNs corporativas y se negocia con IKE (Internet Key Exchange).\n\nAnalogía: un envío con sello oficial (AH) y contenido cifrado (ESP) que viaja dentro de un sobre especial cuando es túnel.",
      "interactive": "none",
      "quiz": {
        "q": "¿Qué componente IPsec cifra el contenido?",
        "options": ["AH", "ESP", "ICMP", "ARP"],
        "a": 1
      }
    },
    {
      "id": "tls",
      "title": "🔒 TLS/SSL — Seguridad en transporte",
      "content": "TLS asegura transporte con cifrado simétrico negociado, autenticación mediante certificados y verificación de integridad. Reemplaza SSL con mejoras de seguridad y rendimiento. El handshake selecciona suites y establece claves (a menudo con ECDHE para forward secrecy).\n\nBuenas prácticas: TLS 1.2/1.3, certificados válidos, HSTS y eliminar suites débiles.\n\nAnalogía: un candado moderno con un certificado oficial que garantiza quién lo colocó y que el candado no se puede forzar fácilmente.",
      "interactive": "tls",
      "quiz": {
        "q": "TLS verifica identidad con…",
        "options": ["Community strings", "Certificados", "ARP", "Echo Reply"],
        "a": 1
      }
    },
    {
      "id": "nmap",
      "title": "🔍 Nmap y Pentesting — Detección de servicios",
      "content": "Nmap realiza reconocimiento: descubre hosts, puertos abiertos y servicios, identifica versiones y, con cuidado, detecta configuraciones débiles. Escaneos comunes incluyen SYN (rápido y sigiloso), UDP (más incierto por silencios), y detección de servicios y scripts NSE.\n\nEn prácticas seguras se limita el alcance y se evita tráfico disruptivo. Esta plataforma simula salidas para aprender sin riesgo.\n\nAnalogía: revisar una casa: ver qué puertas están abiertas, qué actividad hay adentro y qué tipos de cerraduras protegen cada acceso.",
      "interactive": "nmap",
      "quiz": {
        "q": "¿Qué familia de protocolos permite descubrir puertos abiertos?",
        "options": ["TCP/UDP", "ICMP", "ARP", "DNS"],
        "a": 0
      }
    }
  ]
}
